ici-test-automation-feature-environment-readiness/ic-integration-tests/src/test/resources/psrm/receiveClaim/ValidWriteUpAnnulPayment.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:ns="http://skat.dk/begrebsmodel/2009/01/15/">
    <soap:Header/>
    <soap:Body>
        <MFFordringIndberet_I xmlns="http://skat.dk/begrebsmodel/2009/01/15/">
            <Kontekst/>
            <FordringhaverSystemIDStruktur>
                <VirksomhedSENummer>62786515</VirksomhedSENummer>
            </FordringhaverSystemIDStruktur>
            <MFLeveranceID>1500384855481</MFLeveranceID>
            <FordringAktionSamling>
                <FordringAktion>
                    <MFAktionKode>OPSKRIVNINGANNULLERETNEDSKRIVNINGINDBETALING</MFAktionKode>
                    <DMIFordringHaverID>1229</DMIFordringHaverID>
                    <AktionValg>
                        <MFOpskrivningAnnulleretNedskrivningIndbetalingStruktur>
                            <DMIFordringEFIFordringID>156164889156</DMIFordringEFIFordringID>
                            <DMIFordringModtagelseDato>2017-06-19T00:00:00.001</DMIFordringModtagelseDato>
                            <MFAktionID>CHANGE_MFAktionID</MFAktionID>
                            <MFAktionIDRef>98765</MFAktionIDRef>
                            <EFIKundeIdentStruktur>
                                <IdentValg>
                                    <PersonCPRNummer>0209821234</PersonCPRNummer>
                                </IdentValg>
                            </EFIKundeIdentStruktur>
                            <FordringOpskrivningVirkningFra>2017-07-18</FordringOpskrivningVirkningFra>
                            <OpskrivningÅrsagStruktur>
                                <FordringOpskrivningÅrsagBegr>FordringOpskrivning</FordringOpskrivningÅrsagBegr>
                            </OpskrivningÅrsagStruktur>
                            <SagsbemærkningSamling>
                                <MFNoteStruktur>
                                    <MFNoteTekst>Note tekst.</MFNoteTekst>
                                </MFNoteStruktur>
                            </SagsbemærkningSamling>
                            <DokumentSamling>
                                <MFDokumentStruktur>
                                    <DPDokumentArt>ANDET</DPDokumentArt>
                                    <DokumentFormatValg>
                                        <DokumentFil>
                                            <DokumentFilType>dokumentFilType</DokumentFilType>
                                            <DokumentFilIndhold>dokumentFilIndhold</DokumentFilIndhold>
                                        </DokumentFil>
                                    </DokumentFormatValg>
                                </MFDokumentStruktur>
                            </DokumentSamling>
                            <HoeringJournalNummer>12345</HoeringJournalNummer>
                            <OpskrivningBeløbStruktur>
                                <ValutaKode>DKK</ValutaKode>
                                <FordringOpskrivningBeløb>800</FordringOpskrivningBeløb>
                            </OpskrivningBeløbStruktur>
                        </MFOpskrivningAnnulleretNedskrivningIndbetalingStruktur>
                    </AktionValg>
                </FordringAktion>
            </FordringAktionSamling>
        </MFFordringIndberet_I>
    </soap:Body>
</soap:Envelope>